Load-test.yml
config: 
  target: https://http.cat/
  phases:
    - duration: 60
      arrivalRate: 5
      name: Load test
  payload:
    path: "data.csv"
    fields:
      - "data"
  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    ensure: {}    
  ensure:
    thresholds:
      - http.response_time.p95: 1000
    conditions:
      - expression: vusers.failed == 0
      - expression: "http.request_rate >= 2 and http.response_time.max < 600"
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"
          json:
            username: "test User"
            password: "Temp Password"
          capture: 
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"
ensure:
  p95: 500 
  max: 1000 
  min: 200