Load-test.yml
config:
  target: 'https://postman-echo.com/' 
  phases:
    - duration: 60 
      arrivalRate: 5 
      name: "Test obciążeniowy"
  payload:
    path: "payload.csv" 
    fields:
      - "field1"
      - "field2"
  defaults:
    headers:
      Content-Type: "application/json" 

scenarios:
  - flow:
      - get:
          url: "{{ target }}get" 
      - post:
          url: "{{ target }}post" 
          json:
            field1: "{{ field1 }}"
            field2: "{{ field2 }}"

ensure:
  thresholds:
    http.response_time.p95: 500 
    http.response_time.max: 1000 
    vusers.failed: 0