Load-test.yml
config: 
  target: "https://xeno-canto.org/"
  phases:
    - duration: 1
      arrivalRate: 1
      name: Load test
  payload:
    path: "payload.csv"
    fields:
       - "username"
       - "password"
  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    ensure: {}    
  ensure:
    thresholds:
      - http.response_time.p95: 1000
    conditions:
      - expression: vusers.failed == 0
      - expression: "http.request_rate >= 2 and http.response_time.max < 200"
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"
          json:
            username: "Test User"
            password: "Temp Password"
          capture: 
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"
      - log: "Json value from response is: {{request_body}}"
      - log: "Host value from response is: {{host}}"
ensure:
  p95: 500 
  max: 1000 
  min: 200